---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRotation
source: html/aa03654a-d97e-ee11-838b-3677253d7cc2.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRotation Property

The property labeled "Rotation" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.